project-chip/connectedhomeip/src/platform/ESP32/ConnectivityManagerImpl_WiFi.cpp
    UpdateInternetConnectivityState();

    ChipDeviceEvent event;
    event.Type                           = DeviceEventType::kInterfaceIpAddressChanged;
    event.InterfaceIpAddressChanged.Type = InterfaceIpChangeType::kIpV4_Assigned;
    PlatformMgr().PostEventOrDie(&event);
}

void ConnectivityManagerImpl::OnStationIPv4AddressLost(void)
{
    ChipLogProgress(DeviceLayer, "IPv4 address lost on WiFi station interface");

    UpdateInternetConnectivityState();

    ChipDeviceEvent event;
    event.Type                           = DeviceEventType::kInterfaceIpAddressChanged;
    event.InterfaceIpAddressChanged.Type = InterfaceIpChangeType::kIpV4_Lost;
    PlatformMgr().PostEventOrDie(&event);
}

void ConnectivityManagerImpl::OnStationIPv6AddressAvailable(const ip_event_got_ip6_t & got_ip)
{
#if CHIP_PROGRESS_LOGGING
    {
        ChipLogProgress(DeviceLayer, "IPv6 addr available. Ready on %s interface: " IPV6STR, esp_netif_get_ifkey(got_ip.esp_netif),
                        IPV62STR(got_ip.ip6_info.ip));
    }
#endif // CHIP_PROGRESS_LOGGING

    UpdateInternetConnectivityState();

    ChipDeviceEvent event;
    event.Type                           = DeviceEventType::kInterfaceIpAddressChanged;
    event.InterfaceIpAddressChanged.Type = InterfaceIpChangeType::kIpV6_Assigned;
    PlatformMgr().PostEventOrDie(&event);

#if CONFIG_ENABLE_ENDPOINT_QUEUE_FILTER
    uint8_t station_mac[6];
    if (esp_wifi_get_mac(WIFI_IF_STA, station_mac) == ESP_OK)
    {
        static chip::Inet::ESP32EndpointQueueFilter sEndpointQueueFilter;
        char station_mac_str[12];
        for (size_t i = 0; i < 6; ++i)
        {
            uint8_t dig1               = (station_mac[i] & 0xF0) >> 4;
            uint8_t dig2               = station_mac[i] & 0x0F;
            station_mac_str[2 * i]     = static_cast<char>(dig1 > 9 ? ('A' + dig1 - 0xA) : ('0' + dig1));
            station_mac_str[2 * i + 1] = static_cast<char>(dig2 > 9 ? ('A' + dig2 - 0xA) : ('0' + dig2));
        }
        if (sEndpointQueueFilter.SetMdnsHostName(chip::CharSpan(station_mac_str)) == CHIP_NO_ERROR)
        {
            chip::Inet::UDPEndPointImpl::SetQueueFilter(&sEndpointQueueFilter);
        }
        else
        {
            ChipLogError(DeviceLayer, "Failed to set mDNS hostname for endpoint queue filter");
        }
    }
    else
    {
        ChipLogError(DeviceLayer, "Failed to get the MAC address of station netif");
    }
#endif // CONFIG_ENABLE_ENDPOINT_QUEUE_FILTER

#if CONFIG_ENABLE_ROUTE_HOOK
    esp_route_hook_init(esp_netif_get_handle_from_ifkey(ESP32Utils::kDefaultWiFiStationNetifKey));
#endif
}

#if CHIP_CONFIG_ENABLE_ICD_SERVER

CHIP_ERROR ConnectivityManagerImpl::_SetPollingInterval(System::Clock::Milliseconds32 pollingInterval)
{
    (void) pollingInterval;
    // For ESP32 platform, the listen interval of the legacy power-saving mode can only be configured before connecting to AP.
    return CHIP_ERROR_NOT_IMPLEMENTED;
}
#endif // CHIP_CONFIG_ENABLE_ICD_SERVER

} // namespace DeviceLayer
} // namespace chip

#endif // CHIP_DEVICE_CONFIG_ENABLE_WIFI
